<template>
  <main class="main">
    <MainWelcom />
    <div class="post__wrapper">
      <MainPostItem v-for="(item, i) in postData" :key="i" :postData="item" />
      <MainPostItemDiscus />
    </div>
  </main>
</template>

<script>
import MainWelcom from "./WikiMaine/MainWelcom.vue";
import MainPostItem from "./WikiMaine/MainPostItem.vue";
import MainPostItemDiscus from "./WikiMaine/MainPostItemDiscus.vue";

export default {
  name: "TheMaine",
  components: {
    MainWelcom,
    MainPostItem,
    MainPostItemDiscus,
  },
  data() {
    return {
      postData: [
        {
          subtitle: "Избранная статья",
          title: "Иссахар Робертс",
          text: `Иссахар Джейкокс Робертс (англ. Issachar Jacox Roberts, кит. трад. 羅孝全, упр. 罗孝全, пиньинь Luó Xiàoquán, палл. Ло
  Сяоцюань; 1802—1871) — американский миссионер, действовавший в Китае. Прибыл в Макао в 1837 году и первоначально
  проповедовал прокажённым. Представлял Южную баптистскую конвенцию (до 1852 года), в 1842 году стал первым
  баптистским проповедником, начавшим работать в Гонконге и Гуанчжоу. Наиболее известен тем, что проповедовал Хун
  Сюцюаню в 1847 году, а впоследствии принял активное участие в налаживании контактов между государством тайпинов и
  внешним миром. В 1860—1862 годах в течение 15 месяцев служил советником Хун Жэньганя по иностранным делам, и был
  единственным человеком Запада, допущенным во внутренний круг тайпинского руководства. Однако его догматизм и
  культурная негибкость привели к серьёзному конфликту с повстанцами и бегству из пределов тайпинских владений. В
  дальнейшем И. Робертс неизменно критиковал руководство тайпинов и обвинял их в ереси. В 1866 году миссионер
  вернулся в США, где скончался в Аппер-Олтоне от последствий проказы, которой заразился в Китае.`,
          textButton: "Читать",
          textSpan: "Все 1632 избранные статьи",
        },
        {
          subtitle: "Из новых материалов",
          title: "Знаете ли вы?",
          text: `Coca-Cola Glas mit Eis.jpg
Кокаин в «Кока-коле» (на илл.) заменили на корицу, лимон и кориандр.
Писатель продвигал тайваньскую литературу, но сам писал на языке колонизаторов.
Отказ Финляндии запретить игру про ядерную войну с СССР сильно поднял ей продажи.
Преподаватель японского языка погиб за любовь к России.
Флоренс Блументаль
Банкир и меценатка (на илл.) помогли 200 деятелям искусства.
Король-солнце, по-видимому, никогда не говорил, что государство — это он.
Американская журналистка организовала перевод книги Вознесенского новым для Запада методом.
НАСА попросило Россию разработать сценарий ликвидации МКС.
В американском мультфильме героиня «Рамаяны» поёт голосом джазовой певицы 1930-х.
Бременский люк
Социальная копилка (на илл.) может кукарекать, лаять, мяукать и кричать как осёл.
Флорида получила своё имя из-за того, что испанцы высадились на её берега в пасхальную неделю.
«Партия мёртвых» протестовала против пенсионной реформы с плакатом «Жизнь трудна, но, к счастью, коротка».`,
          textButton: "Обсудить",
          textSpan: "",
        },
        {
          subtitle: "Хорошая статья",
          title: "Чаша бурь",
          text: `«Чаша бурь» — фантастический роман Владимира Щербакова, опубликованный в 1985 году. В основе фабулы — противостояние атлантов и этрусков, но сюжет с трудом поддаётся пересказу. Критик Вл. Гаков определял жанр «Чаши бурь» как «историко-лингвистическую фантазию», навеянную собственными псевдоисторическими изысканиями автора на тему «этруски — потомки протославян».
До начала 1990-х годов роман несколько раз переиздавался (частично и целиком) и был крайне низко оценён критиками. В частности, отмечалась аморфность повествования, слабая обоснованность сюжетных ходов, невнятная обрисовка характера протагониста — фантаста Владимира, чья профессия и имя совпадают с авторскими. В основу романа положен эзотерический миф о борьбе Сынов Света с Сынами Тьмы — этрусков с атлантами. Идеи, которые Щербаков в художественной форме выразил в «Чаше бурь», он открыто высказывал в публикациях 1990-х годов, посвящённых Асгарду, Атлантиде и иным легендарным землям.
`,
          textButton: "Читать",
          textSpan: "Все 4200 хороших статей",
        },
        {
          subtitle: "",
          title: "Текущие события",
          text: `Актуальные темы: вспышка оспы обезьян • вторжение России на Украину • лесные пожары в Сибири • пандемия COVID-19 • продовольственный кризис • протесты в Армении | Недавно умершие

Байрам Бегай
В Казахстане на референдуме одобрили реформу Конституции — бывший президент страны Нурсултан Назарбаев лишился конституционного статуса «елбасы».
В Нигерии в результате нападения на католическую церковь погибли 85 человек.
Ига Свёнтек и Рафаэль Надаль стали победителями Открытого чемпионата Франции по теннису в одиночных разрядах.
На президентских выборах в Албании победу одержал Байрам Бегай (на илл.).
К китайской космической станции пристыковался пилотируемый корабль Шэньчжоу-14.
Содружество наций отмечает 70-летие правления Елизаветы II.`,
          textButton: "Другие текущие события",
          textSpan: "",
        },
      ],
      postDiscusData: [],
    };
  },
};
</script>

<style scoped>
.main {
  padding: 20px 24px 24px;
}

.post__wrapper {
  display: grid;
  grid-template-columns: 1fr 1fr;
  gap: 24px;
}
</style>
